{
  "disclaimer": {
    "warning": "WARNING",
    "hazard": "HAZARD OF PHYSICAL INJURY AND UNEXPECTED OPERATION",
    "owners_guide": "Refer to the owner's guide for more detailed information when making any changes to settings or sending commands. Commands sent to this device may affect other components in the system. Ensure that anyone working with the system is aware of the result of your changes before sending a command.",
    "failure": "Failure to follow these instructions can result in death or serious injury",
    "remote_upgrade": "Your Conext Gateway includes an automatic remote firmware upgrade feature or service (the \"Automatic Remote Firmware Upgrade Service\") which will automatically upgrade your Conext Gateway with the latest available firmware, if any, between 2am and 3am on those days on which the upgrades are available and which will be available after you restart the Conext Gateway. You have the option to either enable at a later date or disable this service at any time. Please contact Schneider Electric if you have any questions. By enabling the Automatic Remote Firmware Upgrade Service, you consent to this automatic upgrade of Conext Gateway firmware by Schneider Electric's cloud-based platform Conext Insight. ",
    "upgrade_warranty": "Schneider Electric provides the Automatic Remote Firmware Upgrade Service \"as is\" and without any warranty or representation whatsoever and specifically disclaims any warranty as to its availability, reliability or functionality. Schneider Electric assumes no responsibility or liability from your use of the Automatic Remote Firmware Upgrade Service, and by your enabling of the Automatic Remote Firmware Upgrade Service, you release Schneider Electric from any such responsibility or liability.",
    "agree_upgrade": "I agree with the above and the Automatic Remote Firmware Upgrade Service",
    "remote_monitoring": "Your Conext Gateway includes an internet-based remote monitoring feature or service (the \"Remote Monitoring Service\") which will automatically transmit data about your system equipment, its performance and other variables (the \"System Data\") over the internet to Schneider Electric's computer storage facilities as soon as the Conext Gateway is connected to the internet if you enable the Remote Monitoring Service by checking the box below acknowledging your acceptance of these terms and then clicking the \"I Understand and Accept\" button below. The Remote Monitoring Service provides you access to your System Data via the internet. You have the option to either enable at a later date or disable remote monitoring on the Conext Gateway at any time. Please contact Schneider Electric if you have any questions. Schneider Electric reserves the right to store and retain the System Data indefinitely and the right to use the System Data for any purpose including (but not limited to) quality assurance, engineering performance and product improvements. By enabling the Remote Monitoring Service, you consent to this automatic transmission and Schneider Electric's storage and use of the System Data. ",
    "monitoring_warranty": "Schneider Electric provides the Remote Monitoring Service (including your access to the System Data) without any warranty or representation whatsoever as to its sufficiency, accuracy, availability or reliability and assumes no responsibility or liability from your use of the Remote Monitoring Service.",
    "agree_monitoring": "I agree with the above and the Remote Monitoring Service",
    "accept": "I Understand and Accept",
    "ok": "OK",
    "cancel": "Cancel"
  }
}
