/* Conext CL fault codes - long
 */

{
  "faults_conextcl_long": {
    "0": "No active alarms",
    "710": "The System configuration done by the user/ installer is incorrect. Check and select proper configuration. If the event persists, contact Schneider Electric customer service",
    "711": "The internal configuration shared between processors is incorrect. Disconnect both the AC and DC and restart the inverter. If the event persists contact Schneider Electric customer service",
    "205": "Initialization of Control Processor fails. If the event persists, contact Schneider Electric customer service",
    "203": "Initialization of Control Processor fails.  If the event persists, contact Schneider Electric customer service",
    "705": "PV input wiring reversed. Have a qualified installer check PV input wiring, correct the wiring connections and restart the unit",
    "206": "Built in Self Test of Control Processor fails. If the event persists, contact Schneider Electric customer service",
    "204": "Built in Self Test of Control Processor fails. If the event persists, contact Schneider Electric customer service",
    "712": "The internal configuration is incorrect on the Control Processors. Restart the unit. If the event persists contact Schneider Electric customer service",
    "713": "The internal configuration is incorrect on the Control Processors. Restart the unit. If the event persists contact Schneider Electric customer service",
    "32": "The AC Module temperature is either very high or low. If the event persists, contact Schneider Electric customer service",
    "33": "The DC Module temperature is either very high or low. If the event persists, contact Schneider Electric customer service",
    "709": "The unit has detected an Arc Fault condition. An Arc Fault can be reset only manually. For more details, refer the ?Arc Fault Detection? section in the manual. If the event occurs frequently, contact Schneider Electric customer service",
    "704": "Arc fault detection module failure detected. If the event persists, contact Schneider Electric customer service",
    "714": "The RPO power module has failed. Contact Schneider Electric customer service",
    "10": "Line Tie relay is either welded or opened. If the event persists, contact Schneider Electric customer service",
    "47": "The Grid voltage sensor fails to measure the voltage accurately. Reset the unit by turning off the DC disconnect. If the event persists, contact Schneider Electric customer service",
    "702": "The Earth Leakage current is repeatedly detected to be greater than limited value. Check whether the insulation between the PV to ground is higher than the specified value. If the event persists, contact Schneider Electric customer service",
    "708": "The Earth Leakage current is greater than the limited value. It is checked for repeated occurrence. If the repetition occurs more than four times, then this fault occurs. Check whether the insulation between the PV to ground is higher than the specified value. If the event persists, contact Schneider Electric customer service",
    "31": "The Grid Current Sensor is not measuring the grid current accurately. If the event persists, contact Schneider Electric customer service",
    "131": "The losses in the unit are higher than normal and hence the efficiency is Low. If the event persists, contact Schneider Electric customer service",
    "2616": "The PV insulation measured between any PV input to earth is lesser than the specified limit. Have a qualified installer to check for PV resistance",
    "2647": "RCMU error detected. Excessive steady state residual current or sudden change in residual current. The inverter resumes normal operation after sometime. Wait for the inverter to resume power production",
    "2646": "RCMU error detected. Excessive steady state residual current or sudden change in residual current. The inverter resumes normal operation after sometime. Wait for the inverter to resume power production",
    "701": "The DC content in the AC output current is higher than rated value. If the event persists, contact Schneider Electric customer service",
    "706": "The instantaneous value of DC content in the AC output current is higher than rated value. If the event persists, contact Schneider Electric customer service",
    "2061": "The inverter ambient or AC module temperature is beyond the safe operating limits of the inverter. Switch off the power to the unit, for it to cool. If the event persists, contact Schneider Electric customer service",
    "2062": "The temperature on DC Power modules is beyond the limits. The ambient is beyond the operating limits. Switch off the power to the unit for it to cool. If the event persists, contact Schneider Electric customer service",
    "2624": "The current measured on both the PV channels is higher than the rated values. If the event persists, contact Schneider Electric customer service",
    "2450": "Grid is not available",
    "2406": "The Grid Voltage is below the set limits. The fall in the grid voltage is rapid. Check the voltage, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2407": "The Grid Voltage is above the set limits. The rise in the grid voltage is rapid. Check the voltage, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2401": "The Grid Frequency is below the set limits. The fall in the grid frequency is rapid. Check the frequency, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2402": "The Grid Frequency is above the set limits. The rise in the grid frequency is rapid. Check the frequency, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2418": "The Grid Voltage is below the set limits. Check the voltage, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2419": "The Grid Voltage is above the set limits. Check the voltage, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2416": "The Grid Frequency is below the set limits. Check the frequency, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2417": "The Grid Frequency is above the set limits. Check the frequency, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2415": "The Grid Voltage is above the limits over a set period of time. Restart the inverter. If the event persists, contact Schneider Electric customer service",
    "2410": "The Grid Voltage is below the set limits instantaneously. Check the voltage, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2408": "The Grid Voltage is above the set limits instantaneously. Check the voltage, if it is within the operating limits and the problem persists, contact Schneider Electric customer service",
    "2460": "The current measured in any one phase is beyond the specified limits. Restart the inverter. If the event persists, then contact Schneider Electric customer service",
    "2648": "The losses in the unit are higher than normal. So efficiency is low. Contact Schneider Electric customer service",
    "2060": "The temperature on the AC power modules is lower than the limits. The unit does not start. Wait till the temperature rises to a value greater than the normal temperature",
    "2411": "The Grid Current is above the set limits instantaneously. Restart the inverter. If the event persists, contact Schneider Electric customer service",
    "2605": "The voltage measured at PV1 input terminal is greater than the specified limit. (>950 V). Check for PV configuration and voltage",
    "2606": "The voltage measured at the PV2 input terminal is greater than the specified limit (>950 V). Check for PV configuration and voltage",
    "2631": "PV voltages on both the channels are lesser than the specified value (<200 V)",
    "2018": "This error occurs, when the internal communication between processors in the control board fails after time out. Reset the unit by turning OFF both the DC disconnect and AC breaker (external). If the event persists, contact Schneider Electric customer service",
    "2101": "This error occurs, when the internal communication between processors in the control board fails after time out. Reset the unit by turning OFF both the DC disconnect and AC breaker (external). If the event persists then contact Schneider Electric customer service",
    "4661": "The SPD module connected on the PV1 input channel reached EOL and needs replacement. Contact Schneider Electric customer service",
    "4662": "The SPD module connected on the PV2 input channel reached EOL and needs replacement. Contact Schneider Electric customer service",
    "4663": "The SPD module connected on the AC output channel reached EOL and needs replacement. Contact Schneider Electric customer service",
    "4003": "Fault or FAN EOL detected and needs FAN replacement. Contact Schneider Electric customer service",
    "4004": "Fan Control circuit hardware failure has been detected. Contact Schneider Electric customer service",
    "4068": "The DC Module1 over temperature is detected and the power output from PV1 channel is stopped. The PV1 channel resumes power production once the temperature reduces to a value less than the threshold value",
    "4069": "The DC Module2 Over temperature detected and power output from PV2 channel is stopped. The PV2 channel resumes the power production once the temperature reduces to a value less than the threshold value",
    "2633": "PV1 Over current detected, hence the power output from PV1 is stopped. If the event persists, contact Schneider Electric customer service",
    "2634": "PV2 Over current detected, hence the power output from PV2 is stopped. If the event persists, contact Schneider Electric customer service",
    "4061": "The ambient temperature has crossed the nominal operating range and the unit starts to derate",
    "4660": "The temperature on the AC module has crossed the normal operating limit and the unit starts to derate",
    "4065": "The DC module1 temperature crossed the nominal operating limits and the unit starts to derate",
    "4066": "The DC module2 temperature crossed the nominal operating limits. The unit may start to derate and recover once the temperature reduces to a value less than the threshold value",
    "4656": "The input PV voltage is lower than the nominal operating limits at the PV1 input terminal",
    "4657": "The input PV voltage is lower than the nominal operating limits at the PV2 input terminal",
    "4700": "The input PV power is low. The unit does not go online and recovers when sufficient input power is available",
    "8000": "Internal error reported by the processor. If the event persists, contact Schneider Electric customer service with the inverter LCD display details",
    "9000": "Internal error reported by the processor. If the event persists, contact Schneider Electric customer service with the inverter LCD display details",
    "703": "Comm MCU detected Arc fault condition. Contact Schneider Electric customer service",
    "2102": "Communication error in the Control processor detected by Comm processor. Restart the inverter. If the event persists, contact Schneider Electric customer service",
    "7000": "Internal error reported by Communication Processor. If the event persists, contact Schneider Electric customer service with the inverter LCD display details"
  }
}
